docs(README): add mermaid-based diagram
